/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "L’opération n’a pas pu être effectuée.";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Une erreur inconnue s’est produite (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Impossible d’effectuer l’action";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Réessayez plus tard.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Impossible d’enregistrer";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Impossible d’enregistrer";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Arrêtez toute autre action effectuée avec l’%@ puis réessayez."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Impossible d’enregistrer";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Vous ne disposez pas d’assez d’espace libre pour poursuivre l’écriture du fichier. Libérez-en en effaçant des vidéos ou des photos.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "L’enregistrement a atteint la longueur maximale permise."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "L’enregistrement a atteint la taille de fichier maximale permise."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Arrêtez toute autre action effectuée avec l’appareil d’enregistrement puis réessayez.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "L’enregistrement a atteint la longueur maximale permise."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Impossible d’enregistrer";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Réessayez d’enregistrer.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Impossible d’utiliser l’%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Arrêtez toute autre action effectuée avec l’%@ puis réessayez."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Impossible d’utiliser l’%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Arrêtez toute autre action effectuée avec l’%@ puis réessayez."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Enregistrement arrêté";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Arrêtez toute autre action effectuée avec l’appareil d’enregistrement puis réessayez.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "La torche n’a pas pu être allumée.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Essayez d’allumer la torche à une plus faible intensité.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Impossible d’effectuer l’action";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Réessayez plus tard.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Impossible d’effectuer l’exportation";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Réessayez d’exporter.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Décodage impossible";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Les données multimédias n’ont pas pu être décodées. Elles sont peut-être corrompues.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Ce format de données n’est pas reconnu.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Impossible d’enregistrer";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Réessayez d’enregistrer.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Écriture du fichier de sortie impossible";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Modifiez l’extension de sortie et réessayez.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Ce contenu multimédia est inutilisable.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Ce contenu multimédia est inutilisable.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Ce contenu multimédia est inutilisable.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Ce contenu multimédia est inutilisable.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Ce format de données n’est pas reconnu.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Ce contenu multimédia est peut-être endommagé.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Impossible de prendre une photo";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Réessayez de prendre une photo.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "L’opération n’est pas prise en charge pour du contenu protégé."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Ce contenu n’est pas autorisé."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Cette app n’est pas autorisée à lire ce fichier."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Ce contenu multimédia est inutilisable.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Décodage impossible";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Le décodeur requis pour ce contenu multimédia est introuvable.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Encodage impossible";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "L’encodeur requis pour ce contenu multimédia est introuvable.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Décodage impossible";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Le décodeur requis pour ce contenu multimédia est occupé.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Arrêtez toute autre action qui décode du contenu multimédia puis réessayez.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Encodage impossible";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "L’encodeur requis pour ce contenu multimédia est occupé.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Arrêtez toute autre action qui encode du contenu multimédia puis réessayez.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Impossible d’utiliser l’%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Les apps qui fonctionnent en arrière-plan ne peuvent pas utiliser l’appareil suivant : %@."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "L’opération n’est pas prise en charge pour ce contenu multimédia.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Cette vidéo n’a pas pu être composée conformément aux instructions fournies.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Ce contenu multimédia est inutilisable.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Le fichier de cache à l’URL de destination du téléchargement est inutilisable.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "La somme de contrôle du fichier n’est pas valide.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Arrêtez d’autres opérations et réessayez.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Ouverture impossible";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Ce contenu multimédia est inutilisable sur cet appareil.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Ce contenu multimédia est peut-être endommagé.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Opération interrompue";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Le serveur n’est pas configuré correctement.";
